In [1]:
import pandas as pd
import numpy as np

In [2]:
d1 = {"id":[1,2,3,4],"name":["a","b","c","d"]}
df1 = pd.DataFrame(d1)
d2 = {"id":[1,2,3,4],"marks":[23,11,16,30]}
df2 = pd.DataFrame(d2)

In [3]:
print(df1)

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [4]:
df2

   id  marks
0   1     23
1   2     11
2   3     16
3   4     30

### Merge

#### Syntax

merge(df1,df2,on = "column")

In [5]:
d3 = pd.merge(df1,df2)
d3

   id name  marks
0   1    a     23
1   2    b     11
2   3    c     16
3   4    d     30

### Concat

In [6]:
df3 = pd.concat((df1,df2))
df3

   id name  marks
0   1    a    NaN
1   2    b    NaN
2   3    c    NaN
3   4    d    NaN
0   1  NaN   23.0
1   2  NaN   11.0
2   3  NaN   16.0
3   4  NaN   30.0

In [7]:
#keys helps us identify which data belongs to which dataframe when we use the concat()
df4 = pd.concat((df1,df2),keys =["df1","df2"])
df4

       id name  marks
df1 0   1    a    NaN
    1   2    b    NaN
    2   3    c    NaN
    3   4    d    NaN
df2 0   1  NaN   23.0
    1   2  NaN   11.0
    2   3  NaN   16.0
    3   4  NaN   30.0

### Sort

In [8]:
print(df2.sort_values(by = "marks"))

   id  marks
1   2     11
2   3     16
0   1     23
3   4     30

In [9]:
print(df2.sort_values(by =["id","marks"]))

   id  marks
0   1     23
1   2     11
2   3     16
3   4     30

In [10]:
print(df2.sort_values(by = "marks",ascending=False))

   id  marks
3   4     30
0   1     23
2   3     16
1   2     11

In [11]:
df = pd.read_csv("Teams.csv")

In [12]:
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [13]:
df[df["Team"] == "Riders"]

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017

In [14]:
df.loc[df["Team"] == "Riders"]

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017

In [21]:
df[df["Rank"] >= 2]

    Points  Rank    Team  Year
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
8      694     2  Riders  2016
9      701     4  Royals  2014
11     690     2  Riders  2017

### Apply 

###### apply allows u to apply method on dataframe or a particular column

In [22]:
def lower_case(st):
    return st.lower()

df["Team"].apply(lower_case)

0     riders
1     riders
2     devils
3     devils
4      kings
5      kings
6      kings
7      kings
8     riders
9     royals
10    royals
11    riders
Name: Team, dtype: object

In [23]:
def upper_case(st):
    return st.upper()

df["Team"].apply(upper_case)

0     RIDERS
1     RIDERS
2     DEVILS
3     DEVILS
4      KINGS
5      KINGS
6      KINGS
7      KINGS
8     RIDERS
9     ROYALS
10    ROYALS
11    RIDERS
Name: Team, dtype: object